Revit 2017 API
StructuralSectionIParallelFlange Class
 Defines parameters for I-shape Parallel Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionIParallelFlange : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionIParallelFlange _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionIParallelFlange : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange
See Also
StructuralSectionIParallelFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace